{
  "-udemy-review-are-these-online-courses-worth-it": {
    "title": "Udemy Review - Are These Online Courses WORTH IT?",
    "desc": "Learn more about Udemy",
    "url": "https://www.udemy.com",
    "image": "https://i.ytimg.com/an_webp/TC20K57yC_c/mqdefault_6s.webp?du=3000&sqp=CMmG08IG&rs=AOn4CLCeRD4ALUgSacNUeFkADOn4-mpz_g",
    "video": "https://youtu.be/TC20K57yC_c?si=YAquhH49lWn0kn8C",
    "keywords": "udemy, online-course, school",
    "site_name": "Richard Walls - Career Coach",
    "type": "article",
    "created_at": "2025-06-20T02:40:37.400Z",
    "updated_at": "2025-06-20T02:43:37.854Z"
  },
  "history-of-the-philippines": {
    "title": "History of the Philippines",
    "desc": "The history of the Philippines dates from the earliest hominin activity in the archipelago at least 709,000 years ago. Homo luzonensis, a species of archaic humans, was present on the island of Luzon at least 134,000 years ago.\n\nThe earliest known anatomically modern human remains were found in Tabon Caves in Palawan, dating to about 47,000 years ago. Negrito groups were the first inhabitants to settle in the prehistoric Philippines. These were followed by Austroasiatics, Papuans, and South Asians. By around 3000 BCE, seafaring Austronesians, who form the majority of the current population, migrated southward from Taiwan. By 2000 BCE, the archipelago was the crux of a trans-oceanic Philippine jade culture.\n\nScholars generally believe that these ethnic and social groups eventually developed into various settlements or polities with varying degrees of economic specialization, social stratification, and political organization. Some of these settlements (mostly those located on major river deltas) achieved such a scale of social complexity that some scholars believe they should be considered early states. This includes the predecessors of modern-day population centers such as Manila, Tondo, Pangasinan, Cebu, Panay, Bohol, Butuan, Cotabato, Lanao, Zamboanga, and Sulu, as well as some polities, such as Ma-i, whose possible location is either Mindoro or Laguna.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Carta_Hydrographica_y_Chorographica_de_las_Yslas_Filipinas_Dedicada_al_Rey_Nuestro_Se%C3%B1or_por_el_Mariscal_d._Campo_D._Fernando_Valdes_Tamon_Cavall%C2%BA_del_Orden_de_Santiago_de_Govor._Y_Capn.jpg/250px-thumbnail.jpg",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Carta_Hydrographica_y_Chorographica_de_las_Yslas_Filipinas_Dedicada_al_Rey_Nuestro_Se%C3%B1or_por_el_Mariscal_d._Campo_D._Fernando_Valdes_Tamon_Cavall%C2%BA_del_Orden_de_Santiago_de_Govor._Y_Capn.jpg/250px-thumbnail.jpg",
    "video": "",
    "keywords": "Philippines, history, hominin activity, Homo luzonensis, Luzon, Tabon Caves, Palawan",
    "site_name": "Wikipedia.org",
    "type": "article",
    "created_at": "2025-06-20T03:04:01.906Z",
    "updated_at": "2025-06-20T03:05:31.156Z"
  }
}